
namespace SA_Programacao.script.TelaInicio
{
    public static class Titulo
    {
        public static void Inicio() 
        {
            Mostrar();
            MensagemEnter();
        }


        private static void Mostrar()
        {
            System.Console.WriteLine
                   (
                   "    ▄▄▄▄▄▄ ▄▄ ▄▄ ▄▄▄▄▄   ▄▄ ▄▄  ▄▄▄  ▄▄▄▄  ▄▄   ▄▄  ▄▄▄     ▄▄▄  ▄▄▄▄▄   ▄▄ ▄▄ ▄▄▄▄▄ ▄▄  ▄▄ ▄▄▄▄  ▄▄▄▄  ▄▄ ▄▄ ▄▄  ▄▄▄▄ \n" +
                   "      ██   ██▄██ ██▄▄    ██▄█▀ ██▀██ ██▄█▄ ██▀▄▀██ ██▀██   ██▀██ ██▄▄    ██▄██ ██▄▄  ███▄██ ██▀██ ██▄█▄ ██ ██▄█▀ ███▄▄ \n" +
                   "      ██   ██ ██ ██▄▄▄   ██ ██ ██▀██ ██ ██ ██   ██ ██▀██   ▀███▀ ██      ██ ██ ██▄▄▄ ██ ▀██ ████▀ ██ ██ ██ ██ ██ ▄▄██▀ \n" +
                   "    ===================================================================================================================  "
                   );
        }


        private static void MensagemEnter()
        {
            System.Console.ForegroundColor = System.ConsoleColor.Yellow;
            var espaco = "                                          ";
            System.Console.WriteLine("\n\n\n"+espaco+"<<Aperte qualquer tecla para iniciar>>".ToUpper());
            System.Console.ResetColor();

            System.Console.ReadKey(true);
            System.Console.Clear();
        }
    }
}
